In [2]:
import pandas as pd
import numpy as np

# Sorting in Pandas

In [3]:
data = pd.Series(np.random.randint(50,size=(10)), index = list('abcdefghij'))
data

a    22
b    47
c    41
d     7
e    44
f    22
g    31
h     3
i    22
j    27
dtype: int32

# Series

## Sorting index

In [11]:
data.sort_index()

a    22
b    47
c    41
d     7
e    44
f    22
g    31
h     3
i    22
j    27
dtype: int32

## Ascending values sorting

In [6]:
data.sort_values()

h     3
d     7
a    22
f    22
i    22
j    27
g    31
c    41
e    44
b    47
dtype: int32

## Descending values sorting

In [7]:
data.sort_values(ascending=False)

b    47
e    44
c    41
g    31
j    27
a    22
f    22
i    22
d     7
h     3
dtype: int32

# Dataframe

In [8]:
data_dict = {'names':['vikas','akash','kaash','raash'],
            'marks':[50,55,20,30],
            'salary':[100,200,150,105]}
data_dict

{'names': ['vikas', 'akash', 'kaash', 'raash'],
 'marks': [50, 55, 20, 30],
 'salary': [100, 200, 150, 105]}

In [9]:
data2 = pd.DataFrame(data_dict)
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

## Sorting index column

In [10]:
data2.sort_index(axis = 1)

   marks  names  salary
0     50  vikas     100
1     55  akash     200
2     20  kaash     150
3     30  raash     105

In [12]:
data2.sort_values(by = 'marks')

   names  marks  salary
2  kaash     20     150
3  raash     30     105
0  vikas     50     100
1  akash     55     200

In [13]:
data2.sort_values(by = ['marks','salary'])

   names  marks  salary
2  kaash     20     150
3  raash     30     105
0  vikas     50     100
1  akash     55     200

In [15]:
data2['marks'].sort_values()

2    20
3    30
0    50
1    55
Name: marks, dtype: int64